app/controllers/posts_controller.rb

  def create
    @user = current_user
    @post = @user.posts.create(params[:post])
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "sdgdfsgfds"], ["created_at", Wed, 01 Aug 2012 02:50:00 UTC +00:00], ["name", nil], ["title", "sgfdg"], ["updated_at", Wed, 01 Aug 2012 02:50:00 UTC +00:00], ["user_id", 1]]

  def update
    #@post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "content" = 'fdgfdgsdfdgs4r423', "updated_at" = '2012-08-11 22:32:12.704151' WHERE "posts"."id" = 3

  def destroy
    #@post = Post.find(params[:id])

    if @post.user != current_user
      flash[:notice] = "Você não tem permissão para apagar este post"
      redirect_to posts_url
      #return
    end

    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]